
# ======================== 07章节:单行函数 ========================


# ======================== 07章节讲解: 数值函数-基本函数 ========================
/*

ABS(x)		返回x的绝对值
SIGN(X)		返回X的符号。正数返回1，负数返回-1，0返回0
PI()			返回圆周率的值

CEIL(x), CEILING(x)		返回大于或等于某个值的最小整数; (天花板函数); 向上取整
FLOOR(x)							返回小于或等于某个值的最大整数; (地板函数); 向下取整

LEAST(e1,e2,e3…)			返回列表中的最小值
GREATEST(e1,e2,e3…)		返回列表中的最大值

MOD(x,y)		返回X除以Y后的余数; 取模(16%5=1)

RAND()			返回0~1的随机值
RAND(x)			返回0~1的随机值，相同的X值会产生相同的随机数, 其中x的值 用作 种子值，

ROUND(x)				返回一个对x的值进行四舍五入后，最接近于X的整数
ROUND(x,y)			返回一个对x的值进行四舍五入后最接近X的值，并保留到小数点后面Y位
TRUNCATE(x,y)		返回数字x截断为y位小数的结果
SQRT(x)					返回x的平方根。当X的值为负数时，返回NULL

*/
# 基本数值操作
SELECT
    ABS(-123),ABS(32),
    SIGN(-23),SIGN(43),
    PI(),
    CEIL(32.32),CEILING(-43.23),
    FLOOR(32.32),
    FLOOR(-43.23),
    MOD(16,5), 16 % 5
FROM DUAL;

# 随机数
SELECT
    RAND(),RAND(),			# 每次的随机值是不同的
    RAND(10),RAND(10),	# 传有相同种子值时, 随机值相同
    RAND(-1),RAND(-1)		# 传有相同种子值时, 随机值相同
FROM DUAL;

# 四舍五入
SELECT
    ROUND(12.33),
    ROUND(12.343,2),ROUND(12.324,-1)
FROM DUAL;

# 截断操作(去尾法)
SELECT
    TRUNCATE(12.66,1), TRUNCATE(12.66,-1)
FROM DUAL;

# 单行函数可以嵌套
SELECT
    TRUNCATE(ROUND(293.395,2),1)
FROM DUAL;


# ======================== 07章节讲解: 数值函数-三角函数 ========================

# ======================== 07章节讲解: ========================

